---
type: RibbonButton
namespace: Autodesk.Revit.UI
version: 2024
members: 3
tags: [revit-api, class]
---

# RibbonButton

`Autodesk.Revit.UI.RibbonButton` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Image | — | `public ImageSource Image { get ; set ; }` |
| Property | IsEnabledByContext | — | `public bool IsEnabledByContext { get ; }` |
| Property | LargeImage | — | `public ImageSource LargeImage { get ; set ; }` |